// src/data/questions.js

export const questions = [
    {
      id: 1,
      question: "Каков ваш главный внутренний компас и стремление в жизни?",
      options: [
        { text: "Поиск глубокой истины, личной свободы и созерцание мира" },
        { text: "Создание порядка, защита близких и преодоление препятствий" },
        { text: "Поиск душевной близости, искренней радости и гармонии с людьми" }
      ]
    },
    {
      id: 2,
      question: "Если вы сталкиваетесь с серьезными переменами или неопределенностью, вы...",
      options: [
        { text: "Воспринимаете это с азартом как шанс открыть новые горизонты" },
        { text: "Проявляете осторожность, пытаясь сначала все проанализировать и спланировать" },
        { text: "Относитесь к этому философски — веря, что все перемены ведут к лучшему" }
      ]
    },
    {
      id: 3,
      question: "В компании друзей, коллег или единомышленников вы чаще всего берете роль...",
      options: [
        { text: "Вдохновителя и генератора смелых творческих идей" },
        { text: "Лидера, готового организовать процесс и взять ответственность за результат" },
        { text: "Эмпата, готового выслушать, поддержать теплым словом и сгладить конфликты" },
        { text: "Оптимиста, который разряжает обстановку юмором и дарит легкость" }
      ]
    },
    {
      id: 4,
      question: "Какое высказывание лучше всего описывает ваше отношение к общепринятым правилам?",
      options: [
        { text: "Правила созданы для того, чтобы их нарушать ради прогресса и перемен" },
        { text: "Правила — это основа стабильности и безопасности, их нужно уважать" },
        { text: "Правила полезны, но важнее прислушиваться к зову сердца и конкретной ситуации" }
      ]
    },
    {
      id: 5,
      question: "Какое качество вы назвали бы своей самой сильной стороной?",
      options: [
        { text: "Несгибаемую волю, смелость и готовность бороться до конца" },
        { text: "Острый аналитический ум и стремление во всем дойти до сути вещей" },
        { text: "Способность видеть красоту, любить и сопереживать чужой боли" }
      ]
    },
    {
      id: 6,
      question: "Если бы вы могли мгновенно изменить одну вещь в мире, вы бы...",
      options: [
        { text: "Искоренили несправедливость и защитили всех слабых и нуждающихся" },
        { text: "Дали каждому человеку абсолютную свободу самовыражения и доступ к знаниям" },
        { text: "Наполнили мир радостью, смехом и избавили людей от тревог и уныния" }
      ]
    },
    {
      id: 7,
      question: "В чем для вас заключается истинный жизненный успех?",
      options: [
        { text: "Оставить после себя уникальный след в истории или искусстве" },
        { text: "Достичь признания, высокого статуса и стабильного порядка в своей жизни" },
        { text: "Найти душевный покой, гармонию с собой и близкими людьми" }
      ]
    }
  ];